#### Terraform Plan
```
data.aws_route53_zone.main: Reading...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu planned the following actions, but then encountered a problem:

  # aws_acm_certificate.overlay will be created
  + resource "aws_acm_certificate" "overlay" {
      + arn                       = (known after apply)
      + domain_name               = "hyldrazolxy-overlay.bakas.io"
      + domain_validation_options = [
          + {
              + domain_name           = "hyldrazolxy-overlay.bakas.io"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "hyldrazolxy-overlay.bakas.io",
        ]
      + tags_all                  = {
          + "ManagedBy" = "terraform"
          + "Project"   = "hyldrazolxy-overlay"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_cloudfront_cache_policy.scoresaber_api will be created
  + resource "aws_cloudfront_cache_policy" "scoresaber_api" {
      + arn         = (known after apply)
      + comment     = "120s cache for ScoreSaber API proxy"
      + default_ttl = 120
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 120
      + min_ttl     = 120
      + name        = "hyldrazolxy-overlay-scoresaber-api-120s"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + enable_accept_encoding_brotli = true
          + enable_accept_encoding_gzip   = true

          + cookies_config {
              + cookie_behavior = "none"
            }

          + headers_config {
              + header_behavior = "whitelist"

              + headers {
                  + items = [
                      + "Origin",
                    ]
                }
            }

          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # aws_cloudfront_function.scoresaber_cors will be created
  + resource "aws_cloudfront_function" "scoresaber_cors" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
              var request = event.request;
              var response = event.response;
              var origin = request.headers['origin'] ? request.headers['origin'].value : '';
              if (origin === 'https://hyldrazolxy-overlay.bakas.io') {
                response.headers['access-control-allow-origin'] = { value: origin };
                response.headers['access-control-allow-methods'] = { value: 'GET, HEAD, OPTIONS' };
              }
              return response;
            }
        EOT
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "hyldrazolxy-overlay-scoresaber-cors"
      + publish         = true
      + runtime         = "cloudfront-js-2.0"
      + status          = (known after apply)
    }

  # aws_cloudfront_function.scoresaber_proxy will be created
  + resource "aws_cloudfront_function" "scoresaber_proxy" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
              var request = event.request;
              var match = request.uri.match(/^\/api\/scoresaber\/player\/(\d+)\/basic$/);
              if (!match) {
                return {
                  statusCode: 403,
                  statusDescription: 'Forbidden',
                  body: { encoding: 'text', data: 'Invalid request' }
                };
              }
              request.uri = '/api/player/' + match[1] + '/basic';
              return request;
            }
        EOT
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "hyldrazolxy-overlay-scoresaber-proxy"
      + publish         = true
      + runtime         = "cloudfront-js-2.0"
      + status          = (known after apply)
    }

  # aws_cloudfront_origin_access_control.s3 will be created
  + resource "aws_cloudfront_origin_access_control" "s3" {
      + arn                               = (known after apply)
      + description                       = "OAC for hyldrazolxy-overlay.bakas.io S3 bucket"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "bakasio-hyldrazolxy-overlay-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # aws_s3_bucket.site will be created
  + resource "aws_s3_bucket" "site" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "bakasio-hyldrazolxy-overlay"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "ManagedBy" = "terraform"
          + "Project"   = "hyldrazolxy-overlay"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_public_access_block.site will be created
  + resource "aws_s3_bucket_public_access_block" "site" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Error: listing Route 53 Hosted Zone (Z063319139IB1C4GR3151) tags: operation error Route 53: ListTagsForResource, https response error StatusCode: 403, RequestID: fff2ab3e-2f54-4805-8534-e94ee875c6c4, api error AccessDenied: User: arn:aws:sts::928108668313:assumed-role/hyldrazolxy-overlay-deployer/GitHubActions is not authorized to perform: route53:ListTagsForResource on resource: arn:aws:route53:::hostedzone/Z063319139IB1C4GR3151 because no identity-based policy allows the route53:ListTagsForResource action

  with data.aws_route53_zone.main,
  on cloudfront.tf line 5, in data "aws_route53_zone" "main":
   5: data "aws_route53_zone" "main" {

::error::OpenTofu exited with code 1.

```
*Pushed by: @BakaSoniji*